[
  {
    "situation": {
      "fr": "Invocations du matin – Invocation 3",
      "ar": "أذكار الصباح - الدعاء ٣"
    },
    "transliteration": "Bi-smillāhi alladhī lā yaḍurru maʿa-smihi shay'un fī al-arḍi wa-lā fī s-samā'i wa huwa s-Samīʿu l-ʿAlīm (3 fois)",
    "doua": {
      "fr": "Au nom d'Allah, avec le Nom duquel rien ne peut nuire sur terre ni dans le ciel ; Il est l'Audient, l'Omniscient.",
      "ar": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ (٣ مرات)"
    }
  },
  {
    "situation": {
      "fr": "Invocations du matin – Invocation 4",
      "ar": "أذكار الصباح - الدعاء ٤"
    },
    "transliteration": "Allāhumma bika asbaḥnā, wa bika amsaynā, wa bika naḥyā, wa bika namūtu, wa ilayka n-nushūr.",
    "doua": {
      "fr": "Ô Allah ! C'est par Toi que nous nous retrouvons au matin et au soir. C'est par Toi que nous vivons et mourons, et c'est vers Toi que se fera la Résurrection.",
      "ar": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ"
    }
  },
  {
    "situation": {
      "fr": "Invocations du matin – Invocation 5",
      "ar": "أذكار الصباح - الدعاء ٥"
    },
    "transliteration": "Asbaḥnā wa asbaḥa-l-mulku li-llāh, wa-l-ḥamdu li-llāh. Lā ilāha illā llāhu waḥdahu lā sharīka lah, lahu-l-mulku wa lahu-l-ḥamdu wa huwa ʿalā kulli shay'in qadīr. Rabbi as'aluka khayra mā fī hādhā l-yawm wa khayra mā baʿdah. Wa aʿūdhu bika min sharri mā fī hādhā l-yawm wa sharri mā baʿdah. Rabbi aʿūdhu bika mina-l-kasali wa sū'i l-kibar. Rabbi aʿūdhu bika min ʿadhābin fī n-nār wa ʿadhābin fī l-qabr.",
    "doua": {
      "fr": "Nous voilà au matin et le règne appartient à Allah. Louange à Allah. Il n'y a aucune divinité en dehors d'Allah, Seul, sans associé ; à Lui la royauté, à Lui la louange, et Il est capable de toute chose. Seigneur, je Te demande le bien de ce jour et du suivant ; je cherche refuge auprès de Toi contre le mal de ce jour et du suivant. Seigneur, je cherche refuge auprès de Toi contre la paresse et les maux de la vieillesse. Seigneur, je cherche refuge auprès de Toi contre le châtiment de l'Enfer et celui de la tombe.",
      "ar": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ. لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ. رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ. رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ"
    }
  },
  {
    "situation": {
      "fr": "Invocations du matin – Invocation 13",
      "ar": "أذكار الصباح - الدعاء ١٣"
    },
    "transliteration": "Allāhumma innī as'aluka ʿilman nāfiʿā, wa rizqan ṭayyibā, wa ʿamalan mutaqabbalā.",
    "doua": {
      "fr": "Ô Allah ! Je Te demande un savoir utile, une subsistance licite et des œuvres agréées.",
      "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً"
    }
  },
  {
    "situation": {
      "fr": "Invocations du matin – Invocation 15",
      "ar": "أذكار الصباح - الدعاء ١٥"
    },
    "transliteration": "Raḍītu bi-llāhi rabban, wa bi-l-islāmi dīnan, wa bi-Muḥammadin nabiyyan.",
    "doua": {
      "fr": "J'agrée Allah comme Seigneur, l'Islam comme religion et Muhammad comme prophète.",
      "ar": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا"
    }
  }
]
